app/views/posts/_post.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 21]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 21]]
---
      <div class="like-counter">
        <p><%= post.likes.count %> <%= (post.likes.count) == 1 ? 'Like' : 'Likes'%></p>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <div class="user-info">
        <p>Created by <%= User.find(post.user_id.to_s).name %> <%= distance_of_time_in_words(post.created_at, Time.now) %> ago</p>

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 21]]
---
    <div class="interaction-container">
      <% pre_like = post.likes.find { |like| like.user_id == current_user.id }%>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 21]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 21]]
---
    <div class="interaction-container">
      <button class="show-comments">Show <%= post.comments.count %> Comments</button>