app/views/posts/_tile.html.erb

    <div id="post-info">
      <p>Created by <%= User.find(post.user_id).email %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]