app/views/posts/index.html.erb

      <div class="rank-label-container">
        <span class="label label-default rank-label"><%=@user.posts.count%><%=" posts"%></span><br>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]