app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    respond_to do |format|
      if @comment.save
        format.html { redirect_to user_posts_path(Post.find(@comment.post_id).user_id), notice: 'Comment was successfully created.' }
---
INSERT INTO "comments" ("user_id", "body", "post_id", "created_at", "updated_at", "likes") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["body", "ssss"], ["post_id", 21], ["created_at", "2020-08-07 23:04:16.234233"], ["updated_at", "2020-08-07 23:04:16.234233"], ["likes", 0]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]