app/controllers/likes_controller.rb

INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 23], ["user_id", 1], ["created_at", "2020-08-08 02:05:25.129688"], ["updated_at", "2020-08-08 02:05:25.129688"]]
---
  def create
    if already_liked?
      flash[:notice] = "You already liked that!"
    else
      @post.likes.create(user_id: current_user.id)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."id" = $2 LIMIT $3  [["post_id", 23], ["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def comment_create
    if comment_already_liked?
      flash[:notice] = "You already liked that!"
    else
      @comment.likes.create(user_id: current_user.id)
    end
    redirect_to user_posts_path(Post.find(@comment.post_id).user_id)

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 23]]
---
  def comment_destroy
    if !comment_already_liked?
      flash[:notice] = "You haven't liked that yet!"
    else
      @like.destroy

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 23]]
---
  def destroy
    if !already_liked?
      flash[:notice] = "You haven't liked that yet"
    else
      @like.destroy

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."id" = $2 LIMIT $3  [["post_id", 23], ["id", 1], ["LIMIT", 1]]
---
  def set_like
    @like = @post.likes.find(params[:id])