app/controllers/likes_controller.rb

  def already_liked?
    Like.where(user_id: current_user.id, post_id: params[:post_id]).exists?
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", 1], ["post_id", 21], ["LIMIT", 1]]