app/controllers/posts_controller.rb

  def index
    #on root page there is no user_id in the url
    #gets posts where user_id equals current_user.id OR any of their friends ids
    #TODO
      #root path provides no user_id
      #when going to a friends page, it shows all of THEIR friends
      #posts on their feed as well
    if params[:user_id]
      @user = User.find(params[:user_id])
      @posts = Post.where(user_id: params[:user_id])
    else
      @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" ASC  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at", "body", "user_id", "likes") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2020-08-07 23:09:46.390374"], ["updated_at", "2020-08-07 23:09:46.390374"], ["body", "a post"], ["user_id", 1], ["likes", 0]]